# 设置相关数据

exhibition_ratio = 5   #展台半径
exhibition_coordinate = [[30,20],[30,40],[30,60],[30,80],
                         [55,20],[55,40],[55,60],[55,80],
                         [80,20],[80,40],[80,60],[80,80],
                         [30,1],[40,1],[50,1],[60,1],[70,1],[80,1],
                         [30,99],[40,99],[50,99],[60,99],[70,99],[80,99]] #展台坐标

door_coordinate = [[0,7],[0,8],[0,9],[0,10],[0,11],[0,12],[0,13]] #门的坐标

out_door_coordinate = [[0,86],[0,87],[0,88],[0,89],[0,90],[0,91],[0,92]] #出口的坐标

total_people_num = 200 #参观者人数

allow_inner_max = 20 #允许室内人数上限

enter_time_freqence = 5 #人员进入间隔

infect_button = False #感染演示模式开关

move_sequence = False #是否有序参观开关

infector_cough_freqence = 5 #感染者咳嗽间隔

infector_probability = [0.10,0.90] #%90概率染病

exit_time = 0 #传染者退场后程序结束时间间隔（-1为不结束）

game_time = 50 #每秒循环次数

#enter_rate = [0.1, 0.2,0.5,0.8] #感染者在进入队伍的位置比例（可多个）
enter_rate = [0.2]

WHITE = (225,225,225)
RED = (160,32,240)
S_RED = (227,23,13)
ORANGE = (255,128,0)
GREY = (192, 192, 192)
BAIYAN = (245,245,245)
GREEN = (0, 255, 0)
YELLOW = (255 ,255 ,0)
PURPLE = (160 , 32, 240 )
PINK = (218,112,214)
BLUE = (135 ,206 ,235)
BLACK = (0, 0, 0)
         #  上  右  下  左
p_infect = [0.2,0.3,0.3,0.2]

p_x25y15 = [0.01,0.75,0.15,0.09]
p_x85y15 = [0.01,0.80,0.15,0.04]
p_x99y15 = [0.01,0.02,0.80,0.17]

p_x25y25 = [0.01,0.28,0.70,0.01]
p_x35y25 = [0.05,0.65,0.25,0.05]
p_x85y25 = [0.05,0.45,0.45,0.05]
p_x99y25 = [0.01,0.02,0.7,0.27]

p_x35y85 = [0.10,0.40,0.40,0.10]
p_x85y85 = [0.10,0.4,0.25,0.25]
p_x99y85 = [0.01,0.02,0.6,0.37]

p_x35y99 = [0.1,0.1,0.1,0.7]
p_x85y99 = [0.10,0.05,0.15,0.7]
p_x99y99 = [0.07,0.01,0.02,0.9]

p_2_down = [0.06,0.07,0.8,0.07]

p_2_right =[0.07,0.8,0.07,0.06]
p_2_left = [0.07,0.06,0.07,0.8]

p_1_right = [0.00,0.98,0.02,0.00]
p_1_right_down  = [0.00,0,1,0]
p_1_left = [0.00,0.00,0.00,1]
p_1_left_down = [0.00,0.02,0.98,0.00]
